In [46]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#Use this in Jupyter notebooks to display zoomable images inline.
%matplotlib notebook

# Creating Series and DataFrames

## Creating Series
```python
pd.Series(values, index=index, name=name)
pd.Series({'idx1': val1, 'idx2': val2} 
```
Where values, index are sequences or arrays.
![](./img/Series.png)

In [47]:
# pd.Series(values, index=index, name=name)
pd.Series([1,2,3,4],index=['a','b','c','d'],name='foo')

a    1
b    2
c    3
d    4
Name: foo, dtype: int64

In [48]:
# pd.Series({'idx1': val1, 'idx2': val2} 
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [49]:
# pd.Series({'idx1': val1, 'idx2': val2} 
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

## Creating Dataframe
```python
pd.DataFrame(values, index=index,columns=col_names)
pd.DataFrame({'col1': series1,'col2': series2})
```
![](./img/DataFrame.png)

In [50]:
# 1. Creating from Series
pd.DataFrame(population,columns=['population'])
# pd.DataFrame(values, index=index,columns=col_names)

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [51]:
# 2. Creating from dictionary which is formed via Series
pd.DataFrame({'population':population,'area':area})
# pd.DataFrame({'col1': series1,'col2': series2})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [52]:
# 3. Creating from 2D ndarray of Numpy
pd.DataFrame(np.random.rand(3,2),
             columns=['foo','bar'],
             index=['a','b','c'])
# pd.DataFrame(values, index=index,columns=col_names)

        foo       bar
a  0.987231  0.896431
b  0.476485  0.860329
c  0.990829  0.933742

In [53]:
# 3. Creating from Dictionary of list
data = [{'a':i,'b':2*i} for i in range(3)]
pd.DataFrame(data)
# pd.DataFrame({'col1': series1,'col2': series2})

   a  b
0  0  0
1  1  2
2  2  4

# Index

## Index's indexing and slicing

In [54]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [55]:
print(ind[1])
print(ind[::2])
print(ind.size,ind.shape,ind.ndim,ind.dtype)

3
Int64Index([2, 5, 11], dtype='int64')
5 (5,) 1 int64

## Index as ordered set

In [56]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])
print(indA & indB)
print(indA | indB)
print(indA ^ indB)

Int64Index([3, 5, 7], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
Int64Index([1, 2, 9, 11], dtype='int64')

# "Series" Data & "DataFrame" Data Indexing and Slicing
1. Series
   - Series as dictionary
   - Series as one-dimensional array (like as Numpy)
2. Indexer : loc, iloc, ix
3. DataFrame
   - DataFrame as dictionary
   - DataFrame as two-dimensional array

## Series as dictionary

In [57]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
print(data['b'])
print('-----------------------------------------')
print('a' in data)
print('-----------------------------------------')
print(data.keys())
print('-----------------------------------------')
print(list(data.items()))
print('-----------------------------------------')
data['e'] = 1.25
print(data)

0.5
-----------------------------------------
True
-----------------------------------------
Index(['a', 'b', 'c', 'd'], dtype='object')
-----------------------------------------
[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]
-----------------------------------------
a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

## Series as one-dimensional array (like as Numpy)

In [58]:
data = pd.Series([0.25, 0.5, 0.75, 1.0, 1.25],
                 index=['a', 'b', 'c', 'd', 'e'])
print(data)
print('-----------------------------------------')

# slicing by explicit index
# !!!!!!!!!! Including 'c'
print(data['a':'c'])
print('-----------------------------------------')

# slicing by implicit integer index
# !!!!!!!!!! Not Including 'c'
print(data[0:2])
print('-----------------------------------------')

# masking
print(data[(data > 0.3) & (data < 0.8)])
print('-----------------------------------------')

# fancy indexing
print(data[['a', 'e']])

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64
-----------------------------------------
a    0.25
b    0.50
c    0.75
dtype: float64
-----------------------------------------
a    0.25
b    0.50
dtype: float64
-----------------------------------------
b    0.50
c    0.75
dtype: float64
-----------------------------------------
a    0.25
e    1.25
dtype: float64

## Indexer : loc, iloc, xs

Use these attributes on Series and DataFrames for indexing, slicing, and assignments:
```
s_df.loc[] => Refers only to the index labels
s_df.iloc[] => Refers only to the integer location, similar to lists or Numpy array
s_df.xs(key, axis, level) => Select rows with label key in level level of an object with MultiIndex.
```

In [59]:
data = pd.Series(['a','b','c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [60]:
# data[1]?
# data[1:3]?

In [61]:
print(data[1])
print('-----------------------------------------')
print(data[1:3])

a
-----------------------------------------
3    b
5    c
dtype: object

### s_df.loc[]

In [64]:
data = pd.Series(['a','b','c'], index = [1,3,5])
print(data.loc[1])
print('-----------------------------------------')
print(data.loc[1:3])

a
-----------------------------------------
1    a
3    b
dtype: object

## s_df.iloc[]  => where i means implicit

In [65]:
data = pd.Series(['a','b','c'], index = [1,3,5])
print(data.iloc[1])
print('-----------------------------------------')
print(data.iloc[1:3])

b
-----------------------------------------
3    b
5    c
dtype: object

## s_df.xs[]

In [63]:
# http://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.DataFrame.xs.html

## DataFrame as dictionary

In [66]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [72]:
print(data.area) # same as following
print('-----------------------------------------')
print(data['area']) # <= It's better!

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64
-----------------------------------------
California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [74]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

## DataFrame as two-dimensional array

In [75]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [77]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [79]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [80]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [81]:
#Index and slicing by means of loc, iloc, xs
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [82]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [85]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

# loc with mask!!!!!!!

In [83]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

# Operating on Data in Pandas
1. Ufuncs: Index Preservation
2. UFuncs: Index Alignment
   - Index alignment in Series
   - Index alignment in DataFrame
3. Ufuncs: Operations Between DataFrame and Series

## Ufuncs: Index Preservation

In [89]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
print(ser)
print('-----------------------------------------')
print(np.exp(ser))

0    6
1    3
2    7
3    4
dtype: int64
-----------------------------------------
0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [90]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
print(df)
print('-----------------------------------------')
print(np.sin(df * np.pi / 4))

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4
-----------------------------------------
          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

## UFuncs: Index Alignment

### Index alignment in Series

In [91]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

### Index alignment in DataFrame

In [104]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
print(A)
print('-----------------------------------------')
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
print(B)
print('-----------------------------------------')
print(A + B)

    A   B
0  12   8
1  14  12
-----------------------------------------
   B  A  C
0  0  8  6
1  8  7  0
2  7  7  2
-----------------------------------------
      A     B   C
0  20.0   8.0 NaN
1  21.0  20.0 NaN
2   NaN   NaN NaN

In [105]:
fill = A.stack().mean()
print(fill)
print('-----------------------------------------')
A.add(B, fill_value=fill)

11.5
-----------------------------------------

      A     B     C
0  20.0   8.0  17.5
1  21.0  20.0  11.5
2  18.5  18.5  13.5

The following table lists Python operators and their equivalent Pandas object methods:

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

## Ufuncs: Operations Between DataFrame and Series
> Broadcasting rule is taking on!!!

In [106]:
AA = rng.randint(10, size=(3, 4))
print(AA)
print('-----------------------------------------')
df = pd.DataFrame(AA, columns=list('QRST'))
df - df.iloc[0]

[[0 7 2 2]
 [0 4 9 6]
 [9 8 6 8]]
-----------------------------------------

   Q  R  S  T
0  0  0  0  0
1  0 -3  7  4
2  9  1  4  6

In [107]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -7  0 -5 -5
1 -4  0  5  2
2  1  0 -2  0